[
  {
    "title": "Code Quality",
    "image":"http://d2v8ggac1o0f6z.cloudfront.net/gsc/FDVL08/dc/b3/78/dcb378943c9149838f70975f19cbd3f0/images/audyty_ver_1/u838.png?token=7bcc38a3fcdf32c49d290a64e66633c5",
    "description":"Audyt zastosowanej technologii  i architektury aplikacji, Audyt kodu źródłowego Audyt skalowalności i wydajności aplikacji.Często gdy ktoś wynajmuje firmę do wykonania oprogramowania jest zmuszony zaakceptowac produkt jaki dostanie i nie ma możliwości sprawdzenia co siedzi pod maską, czy to z braku własnych zasobów by to zrobić czy też ze względu na czas. Tutaj wchodzi Code Mine - możemy być filtrem/tarczą między klientem a wykonawcą sprawdzając i oceniając rozwiązania jakie zastosowano i czy na pewno spełniają one wymaania",
    "tasks":[
      {
        "name":"Badanie kodu źródłowego pod kątem zgodności z standardami"
      },
      {
        "name":"Ocena kodu pod kątem braku wykorzystania lub błędnego wykorzystania wzorców projektowych"
      },
      {
        "name":"Sprawdzenie sposobu wykorzystania bibliotek zewnętrznych oraz dostarczanych przez firmy trzecie."
      }
    ],
    "benefits": [
      {
        "name": "Możliwość identyfikacji problemów z czytelnością kodu oraz otrzymania rekomendacji co do jego poprawy co może znacznie wpłynąć na łatwość pracy nad projketem w zespołach."
      },
      {
        "name": "Poprawne stosowanie wzorców projektowych jest niesamowicie ważne dla zachowania wysokiej jakości projektu oraz jego łatwego i bezpiecznego rozwoju. Identyfikacja problemów na jaknajwcześniejszym etapie może przyczynić się do znacznych oszczędności w przyszłosci oraz przyśpieszenia tępa prac nad projetkem."
      },
      {
        "name": "Odporność na zmiany w kodzie nad jakim nie ma kontroli jest bardzo ważna. Zapezpieczenie projektu przed modyfikacjami w bibliotekach zewnętrznych pomaga w minimalizowaniu ilości awarii i problemów z bezpieczeństewm oraz wydajnością."
      }
    ]
  },
  {
    "title": "Usability",
    "image":"http://d2v8ggac1o0f6z.cloudfront.net/gsc/FDVL08/dc/b3/78/dcb378943c9149838f70975f19cbd3f0/images/audyty_ver_1/u833.png?token=7a88aa7069852d395dd50eb8e81ab8da",
    "description":"Audyt usability ma na celu kompleksową analizę użyteczności i funkcjonalności strony internetowej, aplikacji czy systemu. Podczas tego procesu sprawdzamy przede wszystkim intuicyjność strony, łatwość poruszania po niej, przydatność dla internautów i ogólne wrażenia związane z korzystania z usługi. Bierzemy pod uwagę wszystkie czynniki mające wpływ na użyteczność takie jak: architektura informacji, nawigacja, strukturę funkcjonalności dodatkowo sprawdzamy wszystkie ekrany oraz procesy myślowe. Stosujemy najlepsze techniki w zależności od rodzaju powierzonego problemu takie jak: Indywidualne wywiady pogłębione, Card Sorting, Paper prototyping, Eyetracking,",
    "tasks":[
      {
        "name":"Badanie zgodności z heurystykami użyteczności"
      },
      {
        "name":"Badanie efektywności wykonywania scenariuszy użycia"
      },
      {
        "name":"Sprawdzenie sposobu wykorzystania bibliotek zewnętrznych oraz dostarczanych przez firmy trzecie."
      }
    ],
    "benefits": [
      {
        "name": "Możliwość stwierdzenia zgodności aplikacji lub strony pod względem szeroko przyjętnych norm + opis heurystyk."
      },
      {
        "name": "Poprawne stosowanie wzorców projektowych jest niesamowicie ważne dla zachowania wysokiej jakości projektu oraz jego łatwego i bezpiecznego rozwoju. Identyfikacja problemów na jaknajwcześniejszym etapie może przyczynić się do znacznych oszczędności w przyszłosci oraz przyśpieszenia tępa prac nad projetkem."
      },
      {
        "name": "Mozliwośc określenia w jak dużym stopniu architektuara informacji oraz stryuktura strony pomaga lub przeszkadza w sprawnym wykonywaniu najistotnejszych czynności"
      }
    ]
  }
]