{
  "AUDIT": {
    "title": "Audyt",
    "move": "przejdź",
    "quality": {
      "title": "Jakość kodu",
      "description": "Otrzymując gotowe oprogramowanie, firmy zazwyczaj akceptują je bez jakiejkolwiek weryfikacji jakości kodu, bezpieczeństwa, elastyczności, zgodności z wymaganiami oraz wszystkich innych czynników. To nic dziwnego – klienci zwykle nie posiadają odpowiedniej wiedzy czy też czasu.Jako specjaliści, możemy zostać pośrednikiem między Twoją firmą, a Twoim wykonawcą, oceniając zastosowane przez niego rozwiązania. Naszym zadaniem będzie sprawdzenie zgodności kodu ze standardami, a także ocena jego wydajności i wielkość długu technologicznego, przeprowadzając audyty zastosowanej technologii, architektury informacji, kodu źródłowego, skalowalności oraz wydajności aplikacji.",
      "task_1": "Badanie kodu źródłowego pod kątem zgodności z standardami",
      "task_2": "Badanie kodu pod względem poprawności wykorzystania wzorców projektowych",
      "task_3": "Badanie kodu pod względem poprawności wykorzystania wzorców projektowych",
      "task_4": "Badanie elastyczności kodu w perspektywie ewolucji wymagań biznesowych",
      "task_5": "Badania realnego nakładu zasobów",
      "benefit_1": "Identyfikacja problemów dotyczących czytelności kodu wraz z listą rekomendacji w związku z ich poprawą, przyczyniającą się do zwiększenia wydajności zespołowej pracy nad projektem",
      "benefit_2": "Identyfikacja problemów związanych z błędnym zastosowaniem wzorców projektowych, negatywnie rzutujących na jakość projektu oraz jego bezpieczny rozwój przyczyniająca się do przyspieszenia tempa pracy nad projektem i znacznych oszczędności w przyszłości",
      "benefit_3": "Ocena wykorzystania zewnętrznych bibliotek, w tym zabezpieczania projektu przed dokonującymi się w nich zmianami, wpływająca na wydajność oraz neutralizację problemów z bezpieczeństwem",
      "benefit_4": "Ocena poziomu elastyczności narażonego na modyfikacje kodu, pozwalająca podjąć decyzję o jego zwiększeniu, przyczyniającego się z kolei do oszczędzenia czasu i pieniędzy",
      "benefit_5": "Ocena wielkości nakładu zasobów ludzkich i czasowych, niezbędnych do wykonania projektu, pozwalająca określić realia otrzymanej od wykonawcy wyceny"
    },
    "usability": {
      "title": "Użyteczność",
      "description": "Audyt usability ma na celu kompleksową analizę użyteczności i funkcjonalności strony internetowej, aplikacji czy systemu. Podczas tego procesu sprawdzamy przede wszystkim intuicyjność strony, łatwość poruszania po niej, przydatność dla internautów i ogólne wrażenia związane z korzystania z usługi. Bierzemy pod uwagę wszystkie czynniki mające wpływ na użyteczność takie jak: architektura informacji, nawigacja, strukturę funkcjonalności dodatkowo sprawdzamy wszystkie ekrany oraz procesy myślowe. Stosujemy najlepsze techniki w zależności od rodzaju powierzonego problemu takie jak: Indywidualne wywiady pogłębione, Card Sorting, Paper prototyping, Eyetracking,",
      "task_1": "Badanie zgodności z heurystykami",
      "task_2": "Badanie efektywności wdrożonych scenariuszy użycia",
      "task_3": "Badanie zgodności ze standardami UI",
      "benefit_1": "Ocena zgodności aplikacji/ strony z przyjętymi norami, opatrzona opisami heurystyk",
      "benefit_2": "Ocena architektury informacji pod kątem intuicyjności wykonywanych czynności",
      "benefit_3": "Ocena wydajności kanałów komunikacji (web/ mobile) oraz zgodności interfejsów z wytycznymi dla danej platformy"
    }
  },
  "HOME": {
    "motto": {
      "title": "Wydobywany z pasją w samym sercu Śląska,",
      "subtitle": "Quality Driven Development"
    },
    "howWeWork": {
      "title": "Jak pracujemy?",
      "shortCut": "Jak pracujemy?",
      "description": "Gwarantem skuteczności proponowanych przez nas rozwiązań, jest niezmienny proces ich realizacji, składający się z kilku poszczególnych etapów, zaprezentowanych poniżej."
    },
    "hireUs": {
      "title": "Hire us",
      "shortCut": "Hire us",
      "description": "Przejdź do kontaktu lub wypełnij krótki formularz odpowiadając na kilka pytań dotyczących Twojego pomysłu na projekt.",
      "buttonText": "Przejdź do briefu"
    },
    "language": {
      "title": "Tworzymy jednolity język komunikacji",
      "shortCut": "Język komunikacji",
      "description": "W celu zapewnienia efektywnej komunikacji, punktem wyjścia każdego realizowanego przez nas projektu jest stworzenie kompletnego słownika pojęć typowych dla obszaru biznesowego, w jakim porusza się nasz klient."
    },
    "knowledge": {
      "title": "Zdobywamy wiedzę biznesową",
      "shortCut": "Wiedza biznesowa",
      "description": "Uważamy, że zrozumienie branży to podstawa, dlatego kolejnym etapem jest wyczerpująca rozmowa z klientem, pozwalająca nam na wyodrębnienie najistotniejszych elementów, zachowań i modeli, potrzebnych do stworzenia nowego systemu."
    },
    "logic": {
      "title": "Tworzymy logikę biznesową",
      "shortCut": "Logika biznesowa",
      "description": "Po przemyśleniu i zaprojektowaniu modeli działania, następnym krokiem jest przystąpienie do ich programowania. Warto podkreślić, że nasze koncepty testujemy tylko i wyłącznie na prawdziwym kodzie."
    },
    "specification": {
      "title": "Tworzymy szczegółową specyfikację projektu",
      "shortCut": "Specyfikacja",
      "description": "Posiadawszy wymaganą wiedzę, zagłębiamy się w projekt, tworząc jego szczegółową specyfikację. Zakłada ona głównie opracowanie ścieżek użytkownika i modelowanie jego zachowań, opisanie działania poszczególnych komponentów systemu oraz stworzenie poglądowych diagramów.",
      "shortDescription": "Zagłębiamy się w projekt, tworząc jego specyfikację. Zakłada ona głównie opracowanie ścieżek użytkownika i modelowanie jego zachowań, opisanie działania poszczególnych komponentów systemu oraz stworzenie poglądowych diagramów."
    },
    "UX": {
      "title": "Rysujemy makiety UX",
      "shortCut": "Rysujemy UX",
      "description": "Specyfikacja projektu jest podstawą do stworzenia przez nas interaktywnego prototypu interfejsu. Korzystając z posiadanej wiedzy o User Experience, oraz zgromadzonych pojęć dotyczących procesów biznesowych charakterystycznych dla branży klienta, dopracowujemy hierarchie działań i informacji systemu, kładąc nacisk przede wszystkim na wygodę użytkowników (Task Driven UI).",
      "shortDescription": "Korzystając z posiadanej wiedzy o User Experience, oraz zgromadzonych pojęć dotyczących procesów biznesowych charakterystycznych dla branży klienta, dopracowujemy hierarchie działań i informacji systemu, kładąc nacisk przede wszystkim na wygodę użytkowników."
    },
    "UI": {
      "title": "Tworzymy designy",
      "shortCut": "Design",
      "description": "Po pracach nad funkcjonalnościami systemu nadchodzi czas na projektowanie jego warstwy wizualnej. Zawsze dbamy o to, by nasze designy z jednej strony ściśle korespondowały z wartościami marki klienta, a z drugiej – wpisywały w aktualne trendy."
    },
    "implementation": {
      "title": "Implementujemy",
      "shortCut": "Implementacja",
      "description": "Następnym etapem projektu jest implementacja zaprogramowanego interfejsu użytkownika, a więc integracja wcześniej napisanego kodu logiki biznesowej z warstwą aplikacyjną oprogramowania. Tak przygotowany system przechodzi szereg testów, mających potwierdzić jego zgodność z początkowymi założeniami.",
      "shortDescription": "Następnym etapem projektu jest integracja wcześniej napisanego kodu logiki biznesowej z warstwą aplikacyjną oprogramowania. Tak przygotowany system przechodzi szereg testów, mających potwierdzić jego zgodność z początkowymi założeniami.",
      "message": "Sprawdź ofertę"
    },
    "secondImplementation": {
      "title": "Wdrażamy",
      "shortCut": "Wdrażanie",
      "description": "Po pozytywnym przejściu wszystkich testów, software zostaje uruchomiony, a my przechodzimy do szkolenia klienta z zakresu jego funkcjonowania, przekazując tym samym wcześniej skompletowaną, szczegółową dokumentację.",
      "message": "Sprawdź realizację"
    },
    "support": {
      "title": "Wspieramy",
      "shortCut": "Wsparcie",
      "description": "„Go live” systemu nie oznacza końca współpracy. Po oddaniu projektu zapewniamy naszym klientom wsparcie, obejmujące między innymi kwestie związane z drobnymi zmianami, modernizacją oprogramowania czy fachowym doradztwem w jego potencjalnych kierunkach rozwoju.",
      "shortDescription": "Po oddaniu projektu zapewniamy naszym klientom wsparcie, obejmujące między innymi kwestie związane z drobnymi zmianami, modernizacją oprogramowania czy fachowym doradztwem w jego potencjalnych kierunkach rozwoju.",
      "message": "Poznaj nasz zespół"
    }
  },
  "OFFER": {
    "features": {
      "title": "We create",
      "solutionToBusines": {
        "title": "Solutions to your business problems",
        "description": "Rozwiązania problemów nie zawsze są oczywiste – z tego względu pomożemy Ci znaleźć złoty środek, pomagający usprawnić procesy i polepszyć wydajność w Twojej firmie."
      },
      "internalApps": {
        "title": "Internal Apps",
        "description": "Oferujemy wydajne i responsywne, zaawansowane aplikacje dla Twojej firmy, oparte na najnowszych technologiach i możliwe do integracji z systemami enterprise."
      },
      "B2Capplications": {
        "title": "B2C Applications",
        "description": "Zaprojektujemy nowoczesne systemy aplikacji internetowych dla Twoich klientów, które możemy także zintegrować z mediami społecznościowymi czy systemami płatności."
      },
      "socialNetworking": {
        "title": "Social Networking",
        "description": "Sieci społecznościowe to dla nas nie problem – posiadamy doświadczenie zarówno w ich budowaniu, jak i rozwiązywaniu towarzyszących im problemów."
      },
      "TVApps": {
        "title": "TV Apps",
        "description": "Jeśli masz pomysł na aplikację dla Apple TV - zgłoś się do nas! Jesteśmy otwarci na wyzwania i przeanalizujemy każdą Twoją koncepcję."
      },
      "desktopApplications": {
        "title": "Desktop Applications",
        "description": "Projektujemy aplikacje desktopowe dla systemów Windows, Linux i MacOS X, charakteryzujące się wysokim stopniem kompatybilności, stabilności oraz bezpieczeństwa."
      },
      "mobileApps": {
        "title": "Mobile Apps",
        "description": "Tworzymy aplikacje mobilne dedykowane systemom iOS oraz Android, dostosowane z jednej strony do Twoich wymagań, a z drugiej – do aktualnych trendów."
      },
      "openForNew": {
        "title": "?",
        "description": "Jesteśmy otwarci na nowe wyzwania"
      }
    },
    "technologies": {
      "title": "Technologie"
    },
    "languages": {
      "title": "Języki"
    },
    "architecture": {
      "title": "Architektura"
    }
  },
  "COMPANY": {
    "adressTitle": "Skontaktuj się z nami!",
    "showOnMap": "zobacz na mapie",
    "hireUs": "Hire us!",
    "describeUsYourProject": "Opisz nam swój pomysł, formularz pomoże ci sprecyzować czego będzie on dotyczył",
    "navigateToBrief": "Przejdź do briefu"
  },
  "PORTFOLIO": {
    "addProjectTitle": "Dodaj swój projekt",
    "addProjectButton": "Napisz do nas",
    "checkPortfolio": "sprawdź nasze portfolio",
    "starInfo": "Dane przedstawione na ilustracjach oraz filmach są przykładowe",
    "showMore": "Zobacz więcej",
    "sectionTitles": {
      "interface": "Interfejs",
      "before": "Przed",
      "after": "Po",
      "process": "Proces",
      "application": "Zastosowanie",
      "technologies": "Technologie",
      "tools": "Narzędzia",
      "goal": "Cel",
      "build": "Budowa",
      "postsBooking": "Rezerwacja postów",
      "ourRole": "Nasze zadanie",
      "workingScheme": "Schemat działania aplikacji",
      "businessModel": "Model biznesowy",
      "implementation": "Proces wdrażania",
      "arch/tech/tool": "Architektura/języki/narzędzia",
      "microServices": "Mikroserwisy",
      "exchangeProcess": "Proces wymiany walut"
    },
    "BrighterVision": {
      "title": "Brigter Vision Growth Platform",
      "subTitle": "Aplikacja dla amerykańskich terapeutów",
      "shortDescription": "Aplikacja skierowana do amerykańskich terapeutów, pozwalająca na przeglądanie puli dostępnych postów oraz ich publikację w formie bloga.",
      "description": {
        "part1": "Brighter Vision Growth Platform jest odpowiedzią na zjawisko braku czasu poświęconego na marketing – jak chociażby prowadzenie bloga, zauważalnego wśród amerykańskich terapeutów, którzy całą swoją energię przeznaczają na zarządzanie własną praktyką, dbając o każdy, nawet najmniejszy szczegół.",
        "part2": "Aplikacja pozwala na przeglądanie gotowych, dostępnych postów oraz na ich publikację na blogu opartym o Wordpressa w wybranym przez siebie terminie. Jej sercem jest prezentujący zarówno opublikowane, jak i przyszłe posty, ogromny kalendarz, szczegółowo dopracowany pod kątem UI oraz UX.",
        "part3": "Dzięki dobrej kategoryzacji, a także świetnemu mechanizmowi rezerwowania postów, użytkownik jest w stanie zarezerwować wybraną publikację przy pomocy zaledwie trzech kliknięć.",
        "part4": "Zważywszy na model biznesowy, który obok darmowych, zakłada również płatne posty, aplikacja została zintegrowana z systemem płatności Chargify. Użytkownik ma do wyboru wykupienie pojedynczych publikacji lub też miesięcznych subskrypcji. Posty darmowe przyznawane są z kolei miesięcznie, mając określony limit.",
        "part5": "Każdy user dostaje trzy bezpłatne publikacje, które w przypadku niewykorzystania, przechodzą na kolejny miesiąc. Łącznie, użytkownik może uzbierać pokaźną sumę publikacji, których historię może łatwo podejrzeć dzięki zastosowanemu systemowi zliczania sald podobnych do systemów bankowości, opartemu na założeniach Event Sourcingu.",
        "part6": "Pod względem architektury, Growth Platform skupia dwie aplikacje – serwerową oraz kliencką. Aplikacja serwerowa (back-endowa) napisana została w języku PHP, z wykorzystywaniem Zend Framework 2 i odpowiada za kluczowe działania, do których należą głównie publikacja postów, zarządzanie saldem klienta czy zarządzanie publikacjami. ",
        "part7": "Z kolei napisana przy użyciu AngularJS, aplikacja kliencka przyjmuje formę panelu administracyjnego, wykorzystującego komunikację REST API, dostarczaną przez wcześniej wspomnianą, aplikacja serwerową."
      }
    },
    "telecom": {
      "title": "E-commerce dla telecomu",
      "subTitle": "Platforma e-commerce dla wiodących operatorów telekomunikacyjnych w Europie",
      "shortDescription": "Samodzielne moduły oprogramowania przyczyniające się do stworzenia nowoczesnej platformy e-commerce dla wiodących operatorów telekomunikacyjnych w Europie.",
      "description": {
        "part1": "Od początku 2017 roku współpracujemy z dostawcą oprogramowania, rozpowszechniającego swoje rozwiązania wśród wielu wiodących firm z branży telekomunikacyjnej na rynku niemieckim, holenderskim, indyjskim oraz tureckim.",
        "part2": "Udostępniając czterech działających autonomicznie pracowników, naszym zadaniem jest dostarczanie klientowi samodzielnych modułów oprogramowania, finalnie przekazywanych zewnętrznym zespołom. Z tego względu, na każdym kroku czeka na nas sporo wyzwań, z których głównymi są:",
        "part3": "wymóg zdolności naszych mikroserwisów do integracji z wieloma, często przestarzałymi rozwiązaniami klasy eneterprise; ",
        "part4": "mnogość obecnych i wymaganych technologii oraz narzędzi (PHP, Java, C#, Apache Kafka, PostgreSQL, Microsoft BizTalk, Magento);",
        "part5": "czy praca z enigmatycznymi formatami danych",
        "part6": "Zarówno tworzone w JAVIE i PHP mikroserwisy, jak i pisane w technologii ReactJS, aplikacje internetowe, przyczyniają się do stworzenia przez naszego klienta nowoczesnej platformy e-commerce dla operatorów telekomunikacyjnych. Nasze aplikacje to starannie zaprojektowane komponenty, korzystające ponadto z rozwiązań takich jak CQRS czy Event Sourcing.",
        "part7": "Jedną z kluczowych realizacji w ramach tego projektu jest stworzenie systemów katalogowych, pozwalających na integrację wielu istniejących baz danych klientów w jedno wygodne narzędzie.",
        "part8": "Rozwiązanie to jest szczególnie istotne z perspektywy operatorów, którzy kupując inną firmę, nie są w stanie łatwo połączyć wielu baz z systemami rozpoznawania dostępności usług we wskazanych adresach czy katalogami produktów."
      }
    },
    "exchange": {
      "title": "Internetowy system wymiany walut",
      "subTitle": "System przeznaczony do kupna i sprzedaży walut online",
      "shortDescription": "Nowoczesny system pośredniczącym w sprzedaży i zakupie walut, spłatach rat kredytów walutowych, jak również tworzeniu wirtualnych kont walutowych.",
      "description": {
        "part1": "Przez niespełna dwa ostatnie lata mieliśmy przyjemność pracować nad nowoczesnym internetowym systemem wymiany walut, pośredniczącym w sprzedaży i zakupie walut, spłatach rat kredytów walutowych, jak również tworzeniu wirtualnych kont walutowych.",
        "part2": "Naszą rolą było zaprojektowanie platformy finansowej w myśl metodologii Domain Driven Design oraz zasad projektowych S.O.L.I.D., przy jednoczesnym wykorzystaniu najnowszych technologii bezpieczeństwa. Z tego względu, postawiliśmy na szyfrowanie zgodne z protokołem SSL, zabezpieczanie realizacji transakcji poprzez kody SMS i potwierdzenia e-mailowe, a także prowadzenie historii zrealizowanych transakcji.",
        "part3": "Od strony front-endu, platforma ta składała się z dwóch części - aplikacji administracyjnej oraz klienckiej. Z kolei patrząc od strony back-endu, był to system złożony z jedenastu mikroserwisów, komunikujących się ze sobą za pośrednictwem oprogramowania RabbitMQ. Posiadawszy swój własny zestaw odpowiedzialności, każdy moduł mógł być modyfikowany bez najmniejszego wpływu na pozostałe, co pozwalało poszczególnym zespołom skupić się na swojej części projektu, bez konieczności wdrażania się w pozostałe elementy systemu. To znacznie usprawniło cały proces.Oprócz wspomnianego RabbitMQ, projekt ten oparliśmy o wiele innych technologii i narzędzi, takich jak PHP 7 wsparte przez Zend Framework, JavaScript i AngularJS, Bootstrap, RWD, PostgrreSQL czy AWS. ",
        "micro_1_title": "System zarządzania użytkownikami",
        "micro_1": "To system umożliwiający logowanie użytkownika do systemu, dostarczający metod niezbędnych do logowania się do pozostałych mikroserwisów. Odpowiada za zarządzanie uprawnieniami użytkowników, dając ponadto możliwość rejestracji czy logowania za pośrednictwem portalów społecznościowych, takich jak Facebook, Twitter i LinkedIn, jak również innych kont, do których zaliczyć można Google czy Microsoft.",
        "micro_2_title": "System zarządzania klientami",
        "micro_2": "Przechowuje dane klientów oraz logikę biznesową związaną z ich indywidualnymi i firmowymi kontami. Pozwala na zarządzanie kontami klienckimi przez jednego lub wielu użytkowników systemu. ",
        "micro_3_title": "System automatycznego księgowania i zarządzania przelewami",
        "micro_3": "Jest miejscem komunikacji z bankami, przez co stanowi jeden z najważniejszych serwisów aplikacji. Jej integracja z systemami bankowymi pozwoliła na odejście od ręcznego przeglądania wyciągów rachunków bankowych na rzecz natychmiastowego odnotowywania uznań na kontach klientów i szybkiego powiadamiania ich o możliwości zarządzania środkami i wymiany waluty. Ponadto, system ten pozwala na automatyczne zlecanie przelewów wychodzących w odpowiednich ośrodkach bankowych, tuż po decyzji klienta odnośnie wypłaty środków z kont w systemie zarządzania saldami. Oba zastosowane rozwiązania przyczyniły się do minimalizacji liczby pomyłek, zwykle towarzyszących ręcznemu zlecaniu przelewów.",
        "micro_4_title": "System zarządzania saldami ",
        "micro_4": "Umożliwia tworzenie wirtualnych kont walutowych na wzór rachunku bankowego i przechowuje informacje o zgromadzonych środkach i walutach, wyliczanych na podstawie historii transakcji. Zastosowana integralność danych ułatwia zadanie księgowości, która w łatwy sposób może powiązać sumę widoczną u klienta z pieniędzmi odłożonymi w banku, co z kolei sprzyja spełnieniu wymagań komisji nadzoru finansowego. ",
        "micro_5_title": "System zarządzania wymianami walut",
        "micro_5": "Umożliwia kupno i sprzedaż waluty po wcześniej ustalonym przez klienta kursie, lub po aktualnym kursie ustalonym przez system z uwzględnieniem zniżek, rabatów oraz promocji.",
        "micro_6_title": "System komunikacji",
        "micro_6": "Odpowiedzialny jest za kontakt z klientem drogą SMS-ową bądź e-mailową, jak również komunikację między użytkownikami w obrębie systemu, mających pełną kontrolę nad swoimi środkami bez konieczności logowania. Poza tym, system ten wykorzystywany jest także do potwierdzania zleceń poprzez wysyłanie jednorazowego kodu wiadomością SMS.",
        "micro_7_title": "System promocji",
        "micro_7": "Odpowiada za wszelkiego rodzaju promocje i rabaty, a także obliczanie punktów lojalnościowych na podstawie liczby przeprowadzonych transakcji wymiany walut czy ilości osób zaproszonych do korzystania z serwisu (rekomendacje).",
        "micro_8_title": "System zarządzania kursem walut",
        "micro_8": "Zbiera i przechowuje informacje dotyczące aktualnych kursów walut dostarczanych z różnych źródeł, takich jak banki czy giełdy, stanowiąc rdzeń całej platformy.",
        "micro_9_title": "System tworzenia raportów",
        "micro_9": "Analizuje dane przelewów, transakcji wymiany walut i wszelkich promocji, by następnie tworzyć szczegółowe raporty sprzedaży czy podsumowania pracowników i klientów. ",
        "micro_10_title": "System zarządzania dokumentami",
        "micro_10": "Odpowiada za tworzenie dokumentów elektronicznych na podstawie danych dostarczanych z pozostałych mikroserwisów, które użytkownik może wygenerować samodzielnie w różnych formatach (txt, csv, xml, pdf) oraz pobrać przy pomocy jednorazowych linków.",
        "micro_11_title": "System logów aplikacji",
        "micro_11": "Zbiera informacje o czynnościach przeprowadzonych przez użytkowników systemu, jednocześnie będąc zabezpieczeniem w razie awarii głównej bazy danych dzięki zdolności do odtwarzania systemu"
      }
    },
    "MDLinking": {
      "title": "MDLinking",
      "subTitle": "Sieć społecznościowa dla lekarzy z całego świata",
      "shortDescription": "Sieć społecznościowa umożliwiająca prywatną komunikację lekarzy z całego świata i przyczyniająca się do polepszania jakości opieki medycznej.",
      "description": {
        "part1": "MDLinking to platforma umożliwiająca prywatną komunikację między lekarzami z całego świata, przyczyniając się do polepszania jakości opieki medycznej. Serwis pozwala na wzajemną konsultację i dzielenie się wiedzą wśród specjalistów w zamkniętym i bezpiecznym środowisku, a utworzone profile użytkowników funkcjonują ponadto jako wizytówki/ CV dla potencjalnych pracodawców.",
        "web": "Sieć powiązań",
        "part2": "Celem ułatwienia użytkownikom serwisu odnajdywania znajomych z branży oraz wchodzenia z nimi w relacje, stworzyliśmy inteligentny system rekomendacji potencjalnych kontaktów, który na drodze określenia stopnia prawdopodobieństwa znajomości, bierze pod uwagę czynniki takie jak historia zawodowa, miejsce pracy i zamieszkania czy zainteresowania.",
        "intensiveCare": "Oddziały intensywnej opieki",
        "part3": "Poza siecią społecznościową, równie istotnym założeniem aplikacji było przyspieszenie komunikacji pomiędzy szpitalami w utworzonych grupach, dlatego zaprojektowaliśmy system pozwalający także na zlokalizowanie wolnych miejsc na oddziałach intensywnej opieki.",
        "intensiveCare2": "Intensywnej opieki",
        "intensiveCareManagement": "Proces zarządzania oddziałem intensywnej opieki",
        "part4": "Naszą rolą było zaprojektowanie od podstaw elastycznej platformy, zgodnej zarówno z wymaganiami biznesowymi klienta, jak i metodologią Domain Driven Design, a także możliwej do poszerzania o nowe funkcjonalności w miarę rozwoju serwisu.",
        "specification": "Specyfikacja",
        "part5": "Mając przed sobą tak angażujący i długofalowy projekt, na samym początku skupiliśmy się na stworzeniu jego dokładnej specyfikacji oraz rozpisaniu scenariuszy użycia samego serwisu. Wymagało to od nas nie tylko znajomości wymogów klienta, ale przede wszystkim zrozumienia języka branży medycznej i planów rozwoju aplikacji tak, by nie tylko znać jej potrzeby, ale także zdawać sobie sprawę, z czego one wynikają.",
        "logic": "Logika biznesowa",
        "part6": "W następnym etapie przystąpiliśmy do modelowania logiki biznesowej. Tablica, marker, kartka i ołówek w połączeniu z solidną burzą mózgów, pozwoliły nam wyróżnić główne modele, aktorów oraz zachowania, jakie powinien przejawiać tworzony system.",
        "part7": "Znając już podstawy jego działania, zaczęliśmy programować aplikację od strony back-endowej, stosując  język PHP i Zend Framework, połączone z bazą danych PostgreSQL. Następnie, po stworzeniu precyzyjnych makiet interfejsu użytkownika, mogliśmy przejść do prac nad częścią front-edową i jej integracją z REST API. Dla aplikacji dla użytkowników wykorzystaliśmy framework AngularJS, zaś dla panelu administracyjnego – TypeScript.",
        "architecture": "Architektura",
        "part8": "Pod względem architektury, aplikacja MDLinking złożona jest z zestawów niezależnych modułów, komunikujących się przy pomocy RabbitMQ. Każdy z nich posiada swój własny zbiór odpowiedzialności, dzięki czemu moduł odpowiedzialny za użytkowników i ich profile nie jest zależny od części dotyczącej instytucji czy relacji między użytkownikami. Innymi słowy, modyfikacje jednego modułu nie wpływają na pozostałe, co zwiększa szybkość pracy, przy jednoczesnym zmniejszaniu ryzyka błędów.",
        "part9": "Ważną kwestią w przypadku MDLinking jest także bezpieczeństwo aplikacji, będące priorytetem od samego początku jej tworzenia. Podyktowane jest to faktem przechowywania w bazie wielu danych wrażliwych, jak również plików przedstawiających dowody tożsamości czy potwierdzenia uprawnień, wykorzystywanych do weryfikacji autentyczności zakładanych kont. Dzięki implementacji licznych mechanizmów bezpieczeństwa, wszystkie dane aplikacji przechowywane są w zaszyfrowanej formie w bezpiecznych magazynach, dostarczanych przez Amazon AWS, dających nam możliwość dostosowania dostępu do informacji tak, by nie wpadły one w niepowołane ręce.",
        "part10": "W trakcie prac, wraz z biegiem czasu i rozwojem platformy, jej oryginalny model znacznie ewoluował. Wyróżnialiśmy coraz to nowsze odpowiedzialności i zachowania, upraszczając tym samym istniejące, co tylko dowodzi złożoności projektu."
      }
    },
    "MidOceanBrands": {
      "title": "Mid Ocean Brands Reporting System",
      "subTitle": "Planowanie wydajnej produkcji",
      "shortDescription": "Kompleksowe narzędzie służące do planowania wydajności produkcji dla firmy zajmującej się wykonywaniem nadruków graficzne na różnego rodzaju gadżetach.",
      "description": {
        "part1": "Zarządzanie procesem produkcyjnym na dużą skalę jest zadaniem nie tylko pracochłonnym, ale też wysoce skomplikowanym, szczególnie, kiedy głównym używanym narzędziem staje się Microsoft Excel. Tak było w przypadku Mid Ocean Brands – firmy zajmującej się profesjonalnym nadrukiem materiałów graficznych na różnorakich gadżetach, która obecnie może już cieszyć się lepszym, zaproponowanym przez nas rozwiązaniem.",
        "part2": "W zastępstwie dla dokumentów excelowych, dla naszego klienta stworzyliśmy narzędzie pozwalające zaplanować wydajność produkcji na określony czas, a także przedstawiające istotne dane w formie wykresów i raportów. Tym sposobem, rozproszone w wielu arkuszach kalkulacyjnych dane, aktualnie znajdują się w jednym miejscu, wyróżniając się przy tym przyjaznym interfejsem.",
        "part3": "Pierwszym etapem prac było otrzymanie od klienta kilku przykładowych plików, wyeksportowanych z używanego przez niego, oprogramowania SAP. Na ich podstawie, przystąpiliśmy do projektowania głównej funkcjonalności aplikacji, umożliwiającej importowanie danych z plików zawierających nie tylko różną strukturę danych, ale również odmienne formatowanie.",
        "part4": "Efektem końcowym stało się narzędzie, pozwalające z jednej strony na łatwe dodawanie nowych parserów treści, a z drugiej na dopasowanie ustawień importu indywidualnie do każdego z plików, przy jednoczesnym sprawdzaniu wprowadzanych danych pod kątem poprawności ich formatu oraz struktury. Wszystko to zostało opatrzone przejrzystym wyglądem, w pełni dostosowanym do potrzeb klienta.",
        "part5": "Stworzone oprogramowanie oparte zostało o Java 8 Spring Application – aplikację serwerową wystawiającą REST API, połączoną z magazynem danych PostgreSQL, a także aplikację kliencką stworzoną w ReactJS i komunikującą się z częścią serwerową poprzez API. Projekt wykorzystywał także technologię VirtualBox, umożliwiającą konfigurację wirtualnej maszyny, niezbędnej do uruchomienia aplikacji.",
        "part6": "Aplikacja stosowana jest przede wszystkim w celu wprowadzania danych oraz planowania produkcji przez administratora, niemniej jednak, jej przeznaczenie obejmuje także halę produkcyjną, gdzie w czasie rzeczywistym na ekranach prezentuje ona aktualny stan produkcji oraz plan zamówień na najbliższe dni."
      }
    },
    "SmartHome": {
      "title": "System zarządzania inteligentnymi domami",
      "subTitle": "System dostosowany do nowych wymagań technologicznych",
      "shortDescription": "System do zarządzania inteligentnymi domami, konieczny do dostosowania do nowych wymagań technologicznych.",
      "description": {
        "part1": "W 2016 roku mieliśmy okazję współtworzyć oprogramowanie do zarządzania inteligentnymi domami dla naszego norweskiego klienta, będącego jednym z wiodących dostawców tego typu rozwiązań na swoim rynku. Po fuzji, w jaką wszedł on wraz z drugą największą firmą z tej samej branży, niezbędne okazało się dostosowanie istniejącego oprogramowania do komunikacji z urządzeniami obsługującymi protokół ZigBee.",
        "part2": "Poza przystosowaniem systemów zarządzania do nowych możliwości, oferowanych przez urządzenia działające w systemie ZigBee, do naszych głównych zadań należały bieżąca kontrola kodu źródłowego oraz zapewnienie wstecznej kompatybilności dla istniejących klientów. Do zadań projektowych używaliśmy zwłaszcza frameworku Symfony 2, Redis’a oraz bazy PostgreSQL.",
        "part3": "Po skutecznym procesie adaptacji, z przyjemnością przekazaliśmy oprogramowanie w ręce programistów ze strony naszego klienta, którzy mogli zająć się rozwijaniem systemu na miejscu, mając bezpośredni dostęp do wszystkich urządzeń i klientów."
      }
    },
    "Tandarts": {
      "title": "Tandarts.com",
      "subTitle": "Aplikacja zrzeszająca praktyki dentystyczne na terenie Holandii",
      "shortDescription": "Aplikacja zrzeszająca praktyki dentystyczne na terenie Holandii, pozwalająca użytkownikom wyszukać najlepszych specjalistów z okolicy i bezpośrednio umówić się na wizytę.",
      "description": {
        "part1": "Tandarts to aplikacja zrzeszająca praktyki dentystyczne na terenie Holandii. Za jej pomocą użytkownicy mogą wyszukiwać najlepszych dentystów ze swojej okolicy, jak również przy pomocy kilku kliknięć bezpośrednio umawiać się na wizyty do specjalistów, a także weryfikować jakość świadczonych przez nich usług dzięki kompleksowemu systemowi ocen.",
        "part2": "Rolą naszego zespołu było przygotowanie szkieletu systemu, który w późniejszej fazie, po doprowadzeniu go przez nas do fazy MVP (Minimum Viable Product), został przejęty przez holenderską grupę deweloperską, występującą z ramienia klienta. ",
        "part3": "Prace nad projektem rozpoczęły się od długich konsultacji z klientem oraz innymi ekspertami z branży dentystycznej, których owocem stała się starannie zaprojektowana logika biznesowa. Celem było w końcu stworzenie systemu, który nie tylko spełni wszystkie wymagania biznesowe, ale okaże się być również łatwy w rozwoju dla zespołu nieuczestniczącego w jego początkowym projektowaniu. ",
        "part4": "Z tego względu dużą wagę przywiązywaliśmy także do szczegółowej dokumentacji projektu, finalnie przekazanej klientowi."
      }
    },
    "Tripbuzz": {
      "title": "Tripbuzz",
      "subTitle": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.",
      "shortDescription": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.",
      "description": {
        "part1": "Tripuzz to rozbudowana aplikacja webowa, która pozwala swoim użytkownikom odkryć nowe, ciekawe miejsca czy atrakcje, znajdujące się w ich najbliższej okolicy. Choć dziś narzędzie to stanowi obszerną bazę, niegdyś było niezwykle prostą stroną, która za sprawą naszego zespołu, przeszła niemałą transformację.",
        "part2": "Głównym zadaniem Code Mine było rozbudowanie aplikacji o nowe funkcjonalności, jak również rozwijanie tych istniejących. W ramach współpracy wprowadziliśmy nowe atrakcje i dział hoteli, a także zaimplementowaliśmy wersję mobilną. ",
        "part3": "Na każdym etapie prac skupialiśmy się na optymalizacji pod kontem SEO oraz zapewnianiu maksymalnej wydajności, niejednokrotnie podejmując się sporych wyzwań, do których należało między innymi wprowadzenie zaawansowanego algorytmu pozwalającego na szybkie filtrowanie wyników po lokalizacji."
      }
    },
    "ZorgIndicator": {
      "title": "ZorgIndicator",
      "subTitle": "Platforma umożliwiająca pacjentom wyszukanie najlepszych szpitali w okolicy",
      "shortDescription": "Platforma umożliwiająca pacjentom wyszukanie najlepszych szpitali w okolicy, z uwzględnieniem ich oceny, statystyk w leczeniu oraz liczby wolnych łóżek.",
      "description": {
        "part1": "Jako platforma pomagająca w wyszukiwaniu najlepszych szpitali w okolicy, ZorgIndicator został zbudowany z myślą o pacjentach chcących w przystępny sposób uzyskać informacje o ilości szpitalnych łóżek, statystykach w leczeniu chorób czy ocenach innych pacjentów dla danej jednostki.",
        "part2": "Platforma składa się z dwóch komponentów – użytkownika i administratora szpitala, z czego użytkownik może wyszukiwać szpitale po geolokalizacji, sprawdzać ich statystyki i przyznawać oceny; natomiast administrator jest w stanie edytować dane kontaktowe placówki, zarządzając ponadto widocznością związanych z nią lekarzy.",
        "part3": "Oprócz oceny samych szpitali, za pośrednictwem ZorgIndicator możliwe jest także ocenianie poszczególnych specjalistów. Dzięki platformie, pacjenci mają więc pewność zarówno w kwestii kompetencji lekarzy, jak również poziomu obsługi w jednostkach medycznych.",
        "part4": "Naszym celem było zachowanie jak największej elastyczności platformy, w celu umożliwienia jej dalszej rozbudowy o nowe funkcjonalności w przyszłości.",
        "part5": "Z tego względu ZorgIndicator został zaprojektowany zgodnie z metodologią Domain Driven Design, na back-endzie wykorzystując język PHP wsparty frameworkiem Laravel, zaś na front-endzie framework Bootstrap oraz bibliotekę JQuery. W pełni responsywna całość opiera się na bazie danych PostgreSQL, funkcjonując na serwerach AWS."
      }
    }
  },
  "UTILITIES": {
    "tasks": "Zadania",
    "benefits": "Korzyści",
    "showDetails": "Chcesz poznać więcej szczegółów ?",
    "sendRequest": "Wyślij zapytanie",
    "navigateToContact": "Przejdź do kontaktu",
    "technologies": "Technologie"
  },
  "NAVIGATION": {
    "about_as": "o nas",
    "portfolio": "portfolio",
    "offer": "oferta",
    "audit": "audit",
    "contact": "kontakt",
    "pl": "polski",
    "en": "english",
    "de": "deutch",
    "nor": "norsk"
  },
  "ABOUT_US": {
    "place4U": "Być może to miejsce właśnie dla Ciebie?",
    "joinUs": "Dołącz do naszego zespołu już dziś!",
    "name_origin": {
      "title": "Skąd nazwa?",
      "description_part1": "Posiadając swoje biuro w samym sercu Katowic, wśród urokliwych kamienic i kopalnianych szybów, czujemy się silnie związani z naszym środowiskiem. Na wzór dawnych kopalni, z naszej branży staramy się wydobywać to, co najlepsze, jednocześnie przyczyniając się do zmieniania naszego regionu w polską dolinę krzemową. Z kolei wytwarzanie wysokiej jakości kodu jest dla naszych deweloperów na wagę złota, czarnego złota.",
      "description_part2": "Zainspirowani otoczeniem, nie mogliśmy odciąć się od korzeni – wybraliśmy więc nazwę, podkreślającą z jednej strony nasze pochodzenie, a z drugiej – charakter. Tak powstał Code Mine."
    },
    "approach": {
      "title": "Nasze podejście",
      "description": "Duży zespół nie jest miernikiem jakości świadczonych usług – są nim raczej umiejętności, pasja i zaangażowanie. Jako kilkunastoosobowy team pracujący w myśl Quality Driven Development,nie boimy się wyzwań, a nasze indywidualne podejście jest doceniane przez wszystkich klientów."
    },
    "aFewPhotos": "Kilka zdjęć z życia naszego biura"
  },
  "PEOPLE": {
    "worksince": "Wydobycie w Code Mine od: ",
    "year": "rok",
    "przemyslaw": {
      "description": "Jeden z pięciu założycieli Code Mine, oprócz programowania zajmujący się również organizacją firmowej dokumentacji. Najbardziej pokojowy łysy człowiek na ziemi, zdolny do rozwiązania każdego problemu. Wielbiciel muzyki reggae, szybkiej jazdy na deskorolce, zielonego koloru i serowej pizzy. Lubi żartować, często robiąc kawały współpracownikom. W wolnych chwilach lubi odpoczywać na działce."
    },
    "piotr": {
      "description": "Młody i ambitny back-endowiec, który swoje pierwsze próby programowania podjął już pod koniec podstawówki. Lubi wyzwania, dlatego przy wyborze technologii zawsze kieruje się specyfiką projektu, a nie własnymi umiejętnościami. Prywatnie fanatyk zupek chińskich i wielbiciel spontanicznych podróży. Po pracy relaksuje się przy rockowej i punkowe muzyce, często grając również na gitarze"
    },
    "adamn": {
      "description": "Typ przedsiębiorcy, skoncentrowany na osiąganiu postawionych celów zarówno w życiu prywatnym, co zawodowym. Niespełniony fitness model, obecnie pracujący na stanowisku front-end dewelopera, skupiając się na dostarczaniu rozwiązań w możliwie największym stopniu dopasowanych do wymagań klienta. Po pracy pogłębia swoją wiedzę za sprawą branżowej literatury, kursów czy szkoleń. W ramach zainteresowania elektroniką, stara się tchnąć życie w przedmioty martwe, tworząc roboty na Raspberry Pi czy Arduino."
    },
    "joannaK": {
      "description": "Początkująca front-end deweloperka, rozwijająca się w kierunku Angulara i udowadniająca na co dzień, że wcale nie musi to być męski zawód. W życiu prywatnym stawia na zdrowe odżywianie. Lubi też biegać i relaksować się na świeżym powietrzu. Poza biurem – jeśli nie w parku, najłatwiej jest znaleźć ją w domu, gdzie odpoczywa przy serialach Netflixa."
    },
    "tomasz": {
      "description": "Deweloper od najmłodszych lat, specjalizujący się w back-endzie i testowaniu. Jeden z pięciu założycieli Code Mine, wyróżniający się dużym rozsądkiem w wydawaniu pieniędzy. Kocha programować, a atrakcyjne linijki kodu wyzwalają u niego niemałą radość, często wyrażaną tańcem. Uwielbia sporty ekstremalne, do których zalicza grę w szachy, jazdę na rowerze i aktywne oglądanie piłki nożnej z przed telewizora."
    },
    "mateusz": {
      "description": "Ciekawy świata deweloper, którego pierwszą reakcją na nowo poznane rzeczy jest podstawowe pytanie „jak to działa?”. Pasjonat programowania, jak i rozwiązywania wszelkich problemów od najmłodszych lat. Fascynuje się robotami i „zdalnym zmienianiem świata”. W wolnym czasie uprawia sztuki walki oraz rekreacyjnie jeździ na rowerze."
    },
    "radoslaw": {
      "description": "Współzałożyciel i prezes Code Mine. Twardo stąpający po ziemi programista, bazujący głównie na PHP, Javie, TypeScript i JavaScript. Były sędzia koszykówki, który w pracy, mimo kierowniczego stanowiska, od twardych zasad woli swobodę i przyjazną atmosferę. Największą efektywność zapewnia mu grająca w słuchawkach, głośna muzyka elektroniczna. Kocha awokado, a dowodem jego miłości jest jego własna, mini plantacja przy biurku i zwariowane skarpetki z ich wzorem."
    },
    "marta": {
      "description": "Początkująca testerka, starająca się nie przepuścić żadnego błędu. Wśród wszystkich Code Mine'rów wyróżnia się najładniejszym stylem pisma, jak również tym, że jako jedyna w firmie z wyboru używa Windowsa. Prywatnie studentka malarstwa, interesująca się ilustracją i preferująca styl vintage. Wolny czas spędza na górskich wędrówkach."
    },
    "adamg": {
      "description": "Zapalony programista i lider zespołu deweloperów. Jeden z pięciu założycieli Code Mine, którego kariera zaczęła się od udzielania lekcji programowania na zajęciach informatyki w piątej klasie podstawówki. Bezsprzeczny fanboy marki Apple. Wyznawca Domain Driven Design, z miłością tworzący w TypeScript, Swift, Jave oraz… drewnie. Koneser energetyków, od których zarówno zaczyna, jak i kończy pracę."
    },
    "adrian": {
      "description": "Typ obserwatora, skoncentrowanego na osiąganiu swoich celów, z których jednym od zawsze było programowanie. Lubi pracować przy cloudowych brzmieniach i uprzyjemniać tym samym dniówki całego zespołu, pełniąc rolę firmowego DJ-a. Relaksuje się za kierownicą, a najlepszy okres w jego życiu przypada na czas kuponów na podwójne duże frytki z McDonald’s, których jest najszczerszym fanem."
    },
    "kamil": {
      "description": "Niegdyś ratownik medyczny, a dziś dołączający do zespołu Code Mine, prosperujący front-endowiec. Pasjonat programowania i wszelkiego rodzaju elektroniki. Po pracy udaje muzyka, raz po raz uderzając w talerze perkusji w zespole metalcore’owym, czego efektem stają się własne utwory. Najlepszą odskocznią od codzienności są dla niego... skoki ze spadochronem."
    },
    "michal": {
      "description": "Jeden z pięciu założycieli Code Mine, będący pasjonatem programowania obiektowego i Domain Driven Design. Uwielbia Javę, Swifta i psy. Jako prawdziwy smakosz browarów kraftowych, wytwarza własne piwo. Lubi góry i odludne miejsca, które wybiera na weekendowe wycieczki. Idealnym odprężeniem po całodziennym programowaniu w pracy jest dla niego… programowanie w domu."
    },
    "joannar": {
      "description": "Projektantka UX i UI, dla której dzień bez kuriera w firmie jest dniem straconym. Klasowa prymuska z plastyki i matematyki, od zawsze lubiąca ładne rzeczy. Choć w projektowaniu wyznaje zasadę „Less is more”, z życia chce czerpać garściami, planując zwiedzić cały świat. Wielbicielka kotów, z szczególnym wskazaniem na jej własnego – Janusza, ćwiczącego swoją kreatywność w korytarzach spieltunnelu."
    },
    "wojciech": {
      "description": "Kocha projektowanie doświadczeń użytkownika, ale ceni też dobry design, co sprawia, że idealnie nadaje się na swoje stanowisko UX/UI Designera. Fan Apple, nie w mniejszym stopniu lubiący kawę i fast-foody. Na co dzień odlicza czas pozostały do kolejnych podróży i leniuchowania na piaszczystej plaży. Nienawidzi kolejek i stania w korkach. Jest maniakiem obniżania samochodów do granic przyzwoitości."
    }
  },
  "CONTACT": {
    "contactUs": "Skontaktuj się z nami!",
    "name": "Nazwa",
    "myName": "Nazywam się",
    "namePlaceHolder": "podaj imię",
    "emailPlaceHolder": "podaj swój adres email",
    "clickToCopy": "Naciśnij aby skopiować",
    "clickToNavigate": "Naciśnij aby przejść do Google Maps",
    "copied": "Skopiowano!",
    "message": "wiadomość",
    "hello": "Cześć,",
    "send": "Wyślij",
    "requestEstimate": "lub poproś o wycenę swojego projektu",
    "form": {
      "require": "To pole jest wymagane",
      "pattern": "format emaila jest nieprawidowy",
      "sthWentWrong": "Niepoprawna zawartość pola"
    }
  },
  "TECHNOLOGIES": {
    "title": "Technologie",
    "description": "Opis",
    "bash": {
      "description": "Jako powłoka systemów UNIX, Bash jest jednym z najpopularniejszych rozwiązań w swojej kategorii i jednocześnie domyślnym - w większości dystrybucji Linuxa. To narzędzie pozwalające na komunikację między systemem operacyjnym a użytkownikiem bądź aplikacją, które charakteryzuje się uniwersalnością, szybkością oraz ogromnym wachlarzem możliwego wykorzystania.Na co dzień w zdecydowanej większości przypadków instalujemy nasz software na serwerach UNIX'owych, toteż Bash pomaga nam w ich obsłudze, będąc ponadto podstawowym narzędziem do automatyzacji procesów. Tym samym, wykorzystujemy go głównie do skryptów automatyzujących instalację oprogramowania czy skryptów wspierających development, jak również do automatyzacji testów oraz budowania aplikacji."
    },
    "java": {
      "description": "Jako najpopularniejszy obiektowy język programowania, Java charakteryzuje się przede wszystkim niezwykłą sprawnością i szybkością działania, przy jednoczesnym zachowaniu wysokiego stopnia bezpieczeństwa. Niemniej jednak, na komfort pracy z tym językiem wpływają także jego łatwa składnia, wielowątkowość i silne typowanie. W Code Mine szczególnie cenimy go sobie również za promowanie dobrych praktyk programowania obiektowego oraz łatwy dostęp do wiedzy. Co więcej, Java świetnie sprawdza się przy implementacji aplikacji typu enterprise, co dla nas, jako firmy dostarczającej rozwiązania biznesowe szyte na miarę, ma ogromne znaczenie. Jej stosowanie doceniane jest nawet przez samych klientów, którzy podkreślają jej stabilność i popularność. Z tego względu, Java jest naszym numerem jeden, wykorzystywanym zwłaszcza przy aplikacjach serwerowych."
    },
    "javascript": {
      "description": "JavaScript to stworzony pod koniec lat 90. język skryptowy, który choć głównie wykorzystywany jest do tworzenia stron internetowych, może także wzbogacać komponenty programów desktopowych, serwery www, aplikacje mobilne czy nawet dokumenty PDF. Charakteryzując się prostą składnią, uniwersalnością i asynchronicznością, język ten stanowi nasze podstawowe narzędzie do tworzenia software'u. Najczęściej sięgamy po niego przy aplikacjach klienckich do naszych systemów backendowych, używając  AngularJS czy ReactJS, jak również przy multiplatformowych aplikacjach mobilnych, tworzonych we frameworku IONIC."
    },
    "php": {
      "description": "Będący uniwersalnym językiem skryptowym, PHP został stworzony z myślą o stronach i aplikacjach internetowych. Dzięki znacznemu rozwojowi, jaki odnotował na przestrzeni ostatnich lat, staje się językiem coraz bardziej dojrzałym. Ze względu na niskie wymagania hostingowe, PHP odznacza się łatwością jego wdrożenia, toteż często wykorzystujemy go przy naszych projektach. Warto podkreślić, że pracujemy zawsze w jego najnowszej wersji, rozwijając przy tym istniejące biblioteki Open Source. "
    },
    "swift": {
      "description": "Swift to potężny, nowoczesny i niezwykle intuicyjny język programowania na platformy macOS, iOS, watchOS i tvOS, który wszedł na rynek w 2014 roku, zastępując swojego przestarzałego i nieczytelnego poprzednika, Objective-C.Dzięki sporej liczbie ciekawych bibliotek, jak i samej dobrej wydajności tego narzędzia, Swift ułatwia codzienną pracę programistów, będąc stosunkowo łatwym punktem wejścia  także dla deweloperów niemających wcześniej styczności z platformami Apple.Nasi programiści są zaciętymi entuzjastami Swifta i wykorzystują go każdorazowo przy tworzeniu aplikacji na platformy iOS oraz tvOS. Co więcej, cenią sobie przypisany mu komfort pracy do tego stopnia, że stworzyli w nim aplikację wyświetlającą informacje o przebiegu naszych projektów na biurowym Apple TV."
    },
    "typescript": {
      "description": "Będący nakładką JavaScriptu, TypeScript, dzięki typowaniu wpływa na czystość kodu oraz łatwość w jego zarządzaniu. To narzędzie, które w pierwszym etapie pozwala na rozszerzenie funkcjonalności JS, a w ostatnim, automatycznie przekształca do niego powstały kod. TypeScript jest dla nas podstawą przy projektowaniu zaawansowanych aplikacji internetowych. Jego użycie we frameworku Angular, przyczynia się do stabilności oferowanych rozwiązań, jak i szybkości i intuicyjności samego procesu tworzenia."
    }
  },
  "TOOLS": {
    "title": "Narzędzia",
    "AI": {
      "description": "Po Illustratora sięgamy najczęściej w końcowych etapach prac – tuż po dopracowaniu i zatwierdzeniu makiet UX, w programie powstaje UI, czyli warstwa wizualna danego projektu. W Illustratorze projektujemy większość elementów graficznych, począwszy od prostych ikon, a skończywszy na rozmaitych ilustracjach, które z kolei niejednokrotnie stanowią bazę do tworzenia animacji svg, wykorzystywanych w naszych interfejsach."
    },
    "AmazonAWS": {
      "description": "Rozwiązania chmurowe amerykańskiej firmy Amazon pozwalają na tworzenie skalowalnych, wydajnych i bezpiecznych aplikacji w stosunkowo krótkim czasie. Wyróżniają się szerokim asortymentem usług, od baz danych, serwerów, systemów powiadomień czy kolejek zadań, aż po rozwiązania machine learning i analizy danych w czasie rzeczywistym.Wszystkie te cechy sprawiają, że Amazon AWS jest idealnym wyborem dla nowoczesnych aplikacji. Z tego względu pojawia się także w naszych projektach, opieranych na systemach automatycznego zarządzania aplikacjami, do których należy ElasticBeanstalk, czy też na systemach skonteneryzowanych takich jak Elastic Container Service wspierający Docker’a."
    },
    "Angular": {
      "description": "Ze względu na klarowną separację odpowiedzialności oraz łatwość w utrzymaniu czystości kodu, na Angularze opieramy większość naszych projektów o wymagającej strukturze. Co więcej, narzędzie to pozwala nam na szybkie tworzenie aplikacji internetowych wraz z testami jednostkowymi i akceptacyjnymi, z niespotykaną wcześniej łatwością.Stworzone przez firmę Google oraz niezliczoną ilość niezależnych programistów, narzędzie to jest nieustannie rozwijane. Choć bliskie jest nam nawet jego pierwsze wydanie, dopiero od kolejnych wersji Angular rozpoczął nową erę wydajnych oraz elastycznych bibliotek, pozwalających na tworzenie niesamowitych aplikacji internetowych. Przyczyniło się do tego zwłaszcza wprowadzenie w drugiej wersji frameworku podejścia reative programming, które połączone z silnym naciskiem na technologie TypeScript, ustandaryzowało cały proces projektowy."
    },
    "ApacheKafka": {
      "description": "Apache Kafka jest narzędziem umożliwiającym przechowywanie strumieni danych. Tworzy ono kolejkę wiadomości pogrupowanych w tematy, z przypisanymi identyfikatorem i czasem zdarzenia.Ogromną zaletą Apache jest jej skalowalność, wynikająca z działania na tak zwanych klastrach, możliwych do uruchomienia zarówno na jednym, jak i wielu serwerach. Ponadto idealnie sprawdza się również jako tak zwany Event Bus w przypadku aplikacji opartych o Event Sourcing."
    },
    "AxureRP": {
      "description": "Axure stanowi podstawę codziennej pracy naszych UX Designerów. To rozbudowana aplikacja desktopowa, służąca w głównej mierze do tworzenia rozbudowanych prototypów interfejsów użytkownika, diagramów przepływu informacji oraz specyfikacji projektów w wyjątkowo intuicyjny sposób. Zaletą programu jest dodatkowo możliwość projektowania złożonych interakcji – animacji, dynamicznych treści, obliczeń czy warunków logicznych, bez potrzeby programowania.Przygotowane za pomocą aplikacji makiety, czynią proces projektowy bardziej efektywnym, jednocześnie pozwalając naszym klientom na lepsze zrozumienie podejmowanych prac dzięki zobrazowaniu tworzonych funkcjonalności."
    },
    "CircleCl": {
      "description": "Jako jedno z trzech używanych przez nas narzędzi do automatycznego testowania zmian wprowadzanych do kodu źródłowego, Circle CI wyróżnia się ponadprzeciętną uniwersalnością. Jego przewagą są wszechstronne możliwości integracji z innymi narzędziami, takimi jak Github, Bitbucket czy Gitlab, co pozwala nam zachować dużą elastyczność działania. Atutem tego dodatku jest także atrakcyjna cena."
    },
    "Docker": {
      "description": "Będący narzędziem umożliwiającym uruchamianie oprogramowania w autonomicznych kontenerach, Docker pozwala nam projektować i testować aplikacje w środowisku identycznym w porównaniu do tego, który dostępny jest w systemie produkcyjnym. Rozwiązanie to przyczynia się do zmniejszenia ilości błędów, przyspieszając tym samym proces tworzenia oprogramowania.Największą zaletą Docker’a jest jednak jego uniwersalność zwłaszcza, że wspierany jest on przez nowoczesne platformy takie jak Amazon AWS, za pośrednictwem Elastic Container Service czy Elastic Beanstalk. Pod tym kątem narzędzie to znacznie przewyższa wszystkie klasyczne rozwiązania oparte na wirtualizacji"
    },
    "Git": {
      "description": "W pisanie kodu przy dużych projektach najczęściej zaangażowanych jest jednocześnie kilku deweloperów, pracujących na jednym kodzie źródłowym. Git, jako miejsce jego przechowywania, pozwala na śledzenie wszystkich modyfikacji kodu, dając również możliwość zarządzania wszystkimi utworzonymi zmianami w wygodny i czytelny sposób.Za sprawą tego narzędzia jesteśmy ponadto w stanie rozwiązać konflikty powstałe w wyniku pracy kilku programistów nad jedną funkcjonalnością, a także zapobiec całkowitej utracie kodu. To sprawia, że Git, będący obecnie najpopularniejszym systemem kontroli wersji, jest także nieodłącznym elementem każdego tworzonego przez nas projektu."
    },
    "Gradle": {
      "description": "Dzięki możliwości zdefiniowania automatycznych zadań wykonywanych w trakcie zmiany kodu źródłowego w działający program, Gradle zapewnia nam pełną kontrolę nad procesem developmentu i deployu aplikacji.Narzędzie pozwala na szybkie i bezproblemowe pobieranie potrzebnych zależności, ich kompilację oraz intuicyjne zarządzanie, co znacznie uławia cały proces programowania szczególnie, że praktycznie w każdym naszym projekcie posiłkujemy się zewnętrznymi bibliotekami czy frameworkami."
    },
    "Grunt": {
      "description": "Grunt jest jednym z pierwszych systemów automatyzacji pracy, zaimplementowanych w naszych aplikacjach internetowych. Choć moduł ten obecnie nie posiada już swojego miejsca w naszej wirtualnej skrzynce narzędzi, faktem jest, że wciąż pracujemy nad projektami, w których został użyty."
    },
    "Gulp": {
      "description": "Podobnie jak Grunt, Gulp w erze Webpack’a jest narzędziem odsuniętym na drugi plan; nie mniej jednak, nie można zarzucić mu braku użyteczności. Jako system automatyzacji pracy programisty, pozwala na wykonanie wielu zaawansowanych zadań z ogromną łatwością, zwłaszcza w kontekście integracji z nowoczesnymi framework’ami, takimi jak Angular. Z tego powodu Gulp został wykorzystany w kilku projektach, wciąż przez nas wspieranych bądź też rozbudowywanych."
    },
    "Jenkins": {
      "description": "Jenkins jest narzędziem wykorzystywanym przez nas do automatycznego testowania kodu w celu sprawdzenia zgodności wprowadzonych zmian z postawionymi wymaganiami. Jako rozwiązanie nie oferowane w chmurze, Jenkins zapewnia niesamowite możliwości konfiguracyjne, praktycznie niespotykane w innych tego typu narzędziach. Dzięki precyzyjnemu dostosowywaniu sposobu budowania oprogramowania, a także jego testowania i dostarczania, idealnie sprawdza się w projektach wymagających chirurgicznej precyzji pod względem Continous Integration. Oprócz wysokiej elastyczności, cenimy w nim również pełną kontrolę, gwarantowaną poprzez samodzielny hosting."
    },
    "Jira": {
      "description": "Jako ekosystem oprogramowania pozwalającego na łatwe zarządzenie projektami IT, Jira pomaga nam utrzymać każde zlecenie w spójnych ramach, oferując nieograniczone możliwości konfiguracji, stabilność oraz bezpieczeństwo. Zbudowana przez firmę Atlassian, Jira jest kompletnym narzędziem, które z jednej strony umożliwia planowanie i realizację projektów dzięki tworzeniu i weryfikacji zadań oraz zarządzaniu dokumentami; zaś z drugiej – płynną wymianę informacji wśród całego zespołu. Ponadto, może być integrowana z innymi narzędziami – systemami kontroli wersji, kalendarzami czy systemami Continous Integration. W Jirze prowadzone są wszystkie nasze projekty, w których każdorazowo wykorzystujemy  także oferowane przez narzędzie, tablice Agile. Co ważne, platforma dostarcza także system helpdesk, dzięki któremu nasi Klienci posiadają bieżące informacje na temat poszczególnych zgłoszeń, mogąc kontrolować tym samym poziom SLA."
    },
    "JMeter": {
      "description": "JMeter to rozbudowane narzędzie testowe, wyróżniające się szybkością tworzenia złożonych i niezwykle miarodajnych planów testowych, służących nam do sprawdzania wydajności aplikacji, baz danych czy skryptów. Dzięki nim możemy dowiedzieć się jak dane oprogramowanie zachowa się w ekstremalnych, niecodziennych warunkach.Istotną cechą JMeter jest również możliwość przetestowania wielu zależnych od siebie i występujących po sobie żądań. Efektem tak rozbudowanych i skrupulatnych testów są obszerne raporty, które dzięki graficznej formie prezentowania wyników, stają się wyjątkowo przystępne, co znacznie ułatwia proces wyciągania wniosków."
    },
    "Laravel": {
      "description": "Choć Laravel jest stosunkowo młodym frameworkiem MVC dla języka PHP, nie przeszkodziło mu to w zdobyciu znaczącego udziału rynku otwartych rozwiązań. Mimo braku zaawansowanych i wysoce elastycznych rozwiązań charakterystycznych dla innych, używanych przez nas narzędzi tego typu, Laravel zdecydowanie wyróżnia się łatwością tworzenia prostych projektów. Z tego względu stosujemy go zazwyczaj w zespołach, które dopiero kompletują swoje doświadczenie w tym obszarze."
    },
    "MongoDB": {
      "description": "MongoDB jest wydajną, nierelacyjną bazą danych (NotOnlySQL), która ponadto nie wymaga predefiniowanych schematów, co stanowi jedną z jej największych zalet. Baza wykorzystywana jest przede wszystkim do aplikacji zawierających hierarchiczne i różniące się od siebie dane. Zapewnia szybkie operacje na danych, a ponadto świetnie sprawdza się jako cache danych w strukturach intranetowych."
    },
    "MySQL": {
      "description": "Bazy danych są podstawą funkcjonowania niemal każdego oprogramowania internetowego. Jako najpopularniejsza baza dostępna na rynku, MySQL jest narzędziem wysoce uniwersalnym, charakteryzującym się ponadto stosunkowo niskim kosztem utrzymania, dlatego idealnie sprawdza się przy projektach z zawężonymi wymogami hostingowymi, w których priorytetem jest również szybkość i łatwość implementacji."
    },
    "NPM": {
      "description": "Będący jednym z największych źródeł bibliotek i rozwiązań Open Source dostępnych we współczesnym świecie programowania, NPM pozwala nam na wzbogacanie projektu zewnętrznymi, gotowymi rozwiązaniami, bez obaw o ich aktualność czy poprawność. Narzędzie to uważane jest za globalny standard, toteż na stałe zagościło w naszych projektach front-endowych, w których możemy wykorzystywać niemalże każdą pożądaną bibliotekę, co z kolei przekłada się na oszczędność czasu oraz lepszą wydajność."
    },
    "PostgreSQL": {
      "description": "Baza danych jest jednym z najistotniejszych elementów składowych każdego oprogramowania, a jej wybór powinien być dostosowany do złożoności podejmowanego projektu. PostgreSQL, będąca dojrzałą, ale i najbardziej zaawansowaną z dostępnych na rynku, otwartą bazą, wykorzystujemy w przypadku kompleksowych i wymagających programów. Oferowane przez PostgreSQL, niemal nieograniczone możliwości dotyczące zapytań, struktur i rozszerzania jej funkcjonalności, znacznie poprawiają efektywność pracy nad projektem."
    },
    "RabbitMQ": {
      "description": "RabbitMQ jest jednym z najbardziej popularnych narzędzi systemów kolejkowych, pozwalających na swobodną komunikację między rozproszonymi systemami. Również w naszych projektach systemy podzielone są na mikroserwisy, wykorzystując oparte na protokole MQTT, wewnętrzne mechanizmy do wymiany komend i zapytań pomiędzy poszczególnymi serwisami. Takie rozwiązanie pozwala nam tworzyć oprogramowanie z jednej strony wydaje, a z drugiej bezpieczne i skalowalne."
    },
    "ReactJS": {
      "description": "Stworzony przez Facebooka, React JS jest innowacyjnym frameworkiem, wykorzystującym język JSX – hybrydę języka JavaScript oraz HTML. Jest niezastąpiony w przypadku małych i średnich projektów, w których zaawansowana struktura i setki narzędzi, jakie oferuje Angular, nie są wymagane. Przewagą React JS jest ponadto ogromna społeczność udostępniająca setki, jeśli nie tysiące otwartych bibliotek typu Open Source. Korzystanie z dobrych jakościowo, gotowych rozwiązań pozwala oszczędzić czas i budżet, przy jednoczesnym zapewnieniu stabilności i bezpieczeństwa."
    },
    "SASS": {
      "description": "Kaskadowe arkusze stylów CSS są nieoderwalną częścią stron i aplikacji mobilnych, stanowiących największą część naszego portfolio. Tworzenie CSS’ów jest jednak zajęciem niezwykle czasochłonnym, wymagającym niemałej precyzji i uwagi, co z kolei zwiększa ryzyko wystąpienia różnych problemów, wynikających z przeoczenia pewnych detali. Jako preprocesor CSS, SASS został stworzony celem uniknięcia tych błędów, pozwalając na tworzenie ustrukturyzowanych i czytelnych arkuszy stylów w szybkim czasie. Szereg jego zalet sprawił, że używamy go na co dzień, w każdym naszym projekcie."
    },
    "Sketch": {
      "description": "Sketch służy nam do projektowania interfejsów, layoutów, ikon i innych elementów graficznych. Dzięki możliwości odręcznego tworzenia ścieżek, pozwala on na budowanie skomplikowanych kształtów, łatwych do późniejszej edycji, z kolei ze względu na renderowanie powstałych elementów – na ich skalowanie bez utraty jakości. Przydatną funkcjonalnością Sketch’a jest także możliwość podglądania projektu na podłączonym do sieci lokalnej iPhonie z zainstalowaną aplikacją iOS Mirror."
    },
    "SonarQube": {
      "description": "Jakość kodu źródłowego jest dla nas kwestią pierwszorzędną, a narzędzia takie jak SonarQube pomagają nad sprawować nad nią kontrolę. Platforma w łatwy sposób wymusza zgodność kodu z obowiązującymi standardami, wychwytując ponadto miejsca, będące potencjalnym źródłem problemów w przyszłości. Uniwersalność narzędzia sprawia, że jest ono wykorzystywane przez nas zespół w niemalże każdym projekcie."
    },
    "SpringFramework": {
      "description": "Zarówno przy tworzeniu, jak i konfiguracji nowoczesnych aplikacji klasy enterprise, opartych na platformie Java, każdorazowo sięgamy po Spring Framework, zapewniający łatwą integrację z innymi frameworkami i bibliotekami. W myśl zasady convention over configuration, narzędzie to daje nam możliwość  zredukowania pisanego kodu do niezbędnego minimum po to, by móc całkowicie skoncentrować się na rozwiązywaniu złożonych problemów biznesowych. Niewątpliwym atutem Sping’a jest też jego bieżące udoskonalanie, wywołane dużym zainteresowaniem społeczności, jaką przy sobie skupia. Dzięki temu mamy pewność, że oferowane przez framework rozwiązania zawsze należą do innowacyjnych i z powodzeniem możemy wykorzystywać je w swoich projektach, na które składają się zwłaszcza aplikacje serwerowe dostarczające REST/RPC Api."
    },
    "Symfony": {
      "description": "Symfony uznawany jest za jeden z najbardziej profesjonalnych frameworków MVC dla PHP. Współtworzony przez zaangażowane w rozwój tego języka, brazylijskie studio SensioLabs oraz niezliczoną ilość wolontariuszy z całego świata, zyskał ogromne uznanie wśród osób z branży. Czerpiąc inspiracje z Sping Framework, Symfony polega na wielu sprawdzonych wzorach i rozwiązaniach. W efekcie, narzędzie te oferuje ogromną liczbę możliwości i z powodzeniem może być zastosowane do każdego rodzaju projektu. W naszej firmie sięgamy po nie jednak zwłaszcza w przypadku realizacji ograniczonych pod względem czasu czy budżetu, w pełni wykorzystując jego zautomatyzowane działania."
    },
    "TravisCl": {
      "description": "W miarę upływu ery ręcznego wysyłania plików projektów na serwer przy pomocy FTP, narzędzia Continous Integration stały się podstawą bezpiecznego aktualizowania oprogramowania. Pozwalają one na automatyczne przetestowanie kodu przed wprowadzeniem zmian, sprawdzając tym samym, czy nowe modyfikacje spełniają wszystkie wymagane kryteria i oczekiwania. Co istotne, jako jeden z najbardziej powszechnych narzędzi Continous Integration, Travis z powodzeniem może być wykorzystywany w różnych projektach i technologiach. Łatwość jego konfiguracji jest z resztą jednym z wielu argumentów, skłaniającym nas do częstego wybierania tego narzędzia."
    },
    "Vagrant": {
      "description": "Podobnie jak Docker, Vagrant wykorzystywany jest do budowania wirtualnych maszyn oraz zarządzania nimi z jednego miejsca. Narzędzie to pozwala deweloperowi na utworzenie odpowiedniego dla danej aplikacji środowiska, bez względu na używany przez niego system operacyjny czy zainstalowane programy. Wirtualna maszyna powstaje po uruchomieniu wcześniej przygotowanego skryptu konfiguracyjnego. Jego umieszczenie w repozytorium kodu źródłowego projektu daje nam ponadto nieograniczoną kontrolę nad zmianami wprowadzanymi w zależnościach aplikacji."
    },
    "Webpack": {
      "description": "Tworzone przez nas aplikacje i strony internetowe to złożone systemy, składające się z wielu modułów i wzajemnych zależności. Webpack pomaga nam w optymalizacji projektu, zamieniając setki plików HTML, Java Script, Type Script, elementów graficznych czy fontów, w jedną, małą paczkę, możliwą do szybkiego pobrania na urządzeniach mobilnych. Poza poprawą User Experience, Webpack wpływa także na automatyzację pracy, zwiększając efektywność naszego zespołu, który w miejsce konfiguracji projektu, może skoncentrować się na tworzeniu oprogramowania, co z kolei pozwala na lepsze wykorzystanie budżetu."
    },
    "ZendFramework": {
      "description": "Jako jeden z najbardziej wspieranych przez społeczność, a zarazem najbardziej zaawansowanych frameworków, Zend jest wiodącym narzędziem wykorzystywanym w naszych projektach. Decyduje o tym wiele czynników, z których na pierwszy plan wychodzi jego modułowość, pozwalająca na niemal stuprocentowe przystosowanie architektury frameworku do naszych potrzeb. Nie bez znaczenia jest również jego fundament – ze względu na swoją powszechność, język PHP, w którym Zend został napisany, przyczynia się do uniknięcia wszelkich problemów związanych z hostingiem systemu. W swoim zespole posiadamy certyfikowanych architektów frameworku, którzy oprócz bazowania na dostępnych rozwiązaniach, tworzą własne biblioteki, w pełni dostosowane do opisywanego narzędzia. Nasi programiści są ponadto aktywnymi kontrybutorami zarówno w tym, jak i innych projektach, mogąc pochwalić się zainicjowaniem w biurze Code Mine współpracy Zend Framework 3 z Apigility. To właśnie biblioteki tego projektu umożliwiają nam tworzenie zgodnych ze standardami systemów back-endowych dostarczających REST Api, które stanowią największą liczbę naszych projektów opartych na frameworku."
    }
  },
  "PAGETITLE": {
    "prefix": "Code-Mine"
  },

  "home": "home",
  "aboutus": "onas",
  "offer": "oferta",
  "contact": "kontakt",
  "audit": "audyty",
  "not-found": "nie-ma",
  "e-comerce-for-telecom": "e-comerce-dla-telecomu",
  "wecreate": "tworzymy",
  "solutionstoyourbusinessproblems": "solutions-to-your-business-problems",
  "internalapps": "internal-apps",
  "b2capplications": "b2c-applications",
  "socialnetworking": "social-networking",
  "tvapps": "tv-apps",
  "tools": "narzedzia",
  "technologies": "technologie"
}

